In [124]:
import pandas as pd

df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]], columns=['a','b','c'], index=['A','B','C'])
df.head()

   a  b  c
A  1  2  3
B  4  5  6
C  7  8  9

# DATAFRAME SUMMARY

In [125]:
df.tail(2)

   a  b  c
B  4  5  6
C  7  8  9

In [126]:
df.columns

Index(['a', 'b', 'c'], dtype='object')

In [127]:
df.index.tolist()

['A', 'B', 'C']

In [128]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, A to C
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      int64
 1   b       3 non-null      int64
 2   c       3 non-null      int64
dtypes: int64(3)
memory usage: 96.0+ bytes

In [129]:
df.describe()

         a    b    c
count  3.0  3.0  3.0
mean   4.0  5.0  6.0
std    3.0  3.0  3.0
min    1.0  2.0  3.0
25%    2.5  3.5  4.5
50%    4.0  5.0  6.0
75%    5.5  6.5  7.5
max    7.0  8.0  9.0

In [130]:
df.nunique()

a    3
b    3
c    3
dtype: int64

In [131]:
df.shape

(3, 3)

In [132]:
df.size

9

# DATA LOADING

In [133]:
coffee = pd.read_csv('./warmup-data/coffee.csv')

In [134]:
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [135]:
results = pd.read_parquet('./data/results.parquet')

In [136]:
results.head()

,year,type,discipline,event,as,athlete_id,noc,team,place,tied,medal
0,1912.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,None,17.0,True,None
1,1912.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jean Montariol,NaN,False,None
2,1920.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,None,32.0,True,None
3,1920.0,Summer,Tennis,"Doubles, Mixed (Olympic)",Jean-François Blanchy,1,FRA,Jeanne Vaussard,8.0,True,None
4,1920.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jacques Brugnon,4.0,False,None

In [137]:
olympics_data = pd.read_excel('./data/olympics-data.xlsx', sheet_name='results')

In [138]:
olympics_data.head()

,year,type,discipline,event,as,athlete_id,noc,team,place,tied,medal
0,1912.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,NaN,17.0,True,NaN
1,1912.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jean Montariol,NaN,False,NaN
2,1920.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,NaN,32.0,True,NaN
3,1920.0,Summer,Tennis,"Doubles, Mixed (Olympic)",Jean-François Blanchy,1,FRA,Jeanne Vaussard,8.0,True,NaN
4,1920.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jacques Brugnon,4.0,False,NaN

In [139]:
bios = pd.read_csv('./data/bios.csv')

In [140]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

# DATA ACCESS

In [141]:
coffee.head(10)

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35
5  Wednesday       Latte          25
6   Thursday    Espresso          40
7   Thursday       Latte          30
8     Friday    Espresso          45
9     Friday       Latte          35

In [142]:
coffee.sample(5)

         Day Coffee Type  Units Sold
12    Sunday    Espresso          45
3    Tuesday       Latte          20
10  Saturday    Espresso          45
8     Friday    Espresso          45
2    Tuesday    Espresso          30

In [143]:
coffee.loc[[0, 1, 2]]

       Day Coffee Type  Units Sold
0   Monday    Espresso          25
1   Monday       Latte          15
2  Tuesday    Espresso          30

In [144]:
coffee.loc[0:2]

       Day Coffee Type  Units Sold
0   Monday    Espresso          25
1   Monday       Latte          15
2  Tuesday    Espresso          30

In [145]:
coffee.loc[0:2,['Units Sold']]

   Units Sold
0          25
1          15
2          30

In [146]:
coffee.loc[0:2]

       Day Coffee Type  Units Sold
0   Monday    Espresso          25
1   Monday       Latte          15
2  Tuesday    Espresso          30

In [147]:
coffee.index = coffee['Day']

In [148]:
coffee.head()

                 Day Coffee Type  Units Sold
Day
Monday        Monday    Espresso          25
Monday        Monday       Latte          15
Tuesday      Tuesday    Espresso          30
Tuesday      Tuesday       Latte          20
Wednesday  Wednesday    Espresso          35

In [149]:
coffee.loc['Monday']

           Day Coffee Type  Units Sold
Day
Monday  Monday    Espresso          25
Monday  Monday       Latte          15

In [150]:
coffee.loc['Wednesday':'Sunday']

                 Day Coffee Type  Units Sold
Day
Wednesday  Wednesday    Espresso          35
Wednesday  Wednesday       Latte          25
Thursday    Thursday    Espresso          40
Thursday    Thursday       Latte          30
Friday        Friday    Espresso          45
Friday        Friday       Latte          35
Saturday    Saturday    Espresso          45
Saturday    Saturday       Latte          35
Sunday        Sunday    Espresso          45
Sunday        Sunday       Latte          35

In [151]:
coffee.loc['Wednesday', 'Units Sold'] = 1000

In [152]:
coffee.head(10)

                 Day Coffee Type  Units Sold
Day
Monday        Monday    Espresso          25
Monday        Monday       Latte          15
Tuesday      Tuesday    Espresso          30
Tuesday      Tuesday       Latte          20
Wednesday  Wednesday    Espresso        1000
Wednesday  Wednesday       Latte        1000
Thursday    Thursday    Espresso          40
Thursday    Thursday       Latte          30
Friday        Friday    Espresso          45
Friday        Friday       Latte          35

In [153]:
coffee.at['Monday','Coffee Type']

Day
Monday    Espresso
Monday       Latte
Name: Coffee Type, dtype: object

In [154]:
coffee.Day

Day
Monday          Monday
Monday          Monday
Tuesday        Tuesday
Tuesday        Tuesday
Wednesday    Wednesday
Wednesday    Wednesday
Thursday      Thursday
Thursday      Thursday
Friday          Friday
Friday          Friday
Saturday      Saturday
Saturday      Saturday
Sunday          Sunday
Sunday          Sunday
Name: Day, dtype: object

# DATA MANIPULATION

In [155]:
coffee.sort_values('Units Sold', ascending=False)

                 Day Coffee Type  Units Sold
Day
Wednesday  Wednesday    Espresso        1000
Wednesday  Wednesday       Latte        1000
Saturday    Saturday    Espresso          45
Sunday        Sunday    Espresso          45
Friday        Friday    Espresso          45
Thursday    Thursday    Espresso          40
Saturday    Saturday       Latte          35
Friday        Friday       Latte          35
Sunday        Sunday       Latte          35
Tuesday      Tuesday    Espresso          30
Thursday    Thursday       Latte          30
Monday        Monday    Espresso          25
Tuesday      Tuesday       Latte          20
Monday        Monday       Latte          15

In [156]:
coffee.sort_values(['Units Sold','Coffee Type'], ascending=[0,1])

                 Day Coffee Type  Units Sold
Day
Wednesday  Wednesday    Espresso        1000
Wednesday  Wednesday       Latte        1000
Friday        Friday    Espresso          45
Saturday    Saturday    Espresso          45
Sunday        Sunday    Espresso          45
Thursday    Thursday    Espresso          40
Friday        Friday       Latte          35
Saturday    Saturday       Latte          35
Sunday        Sunday       Latte          35
Tuesday      Tuesday    Espresso          30
Thursday    Thursday       Latte          30
Monday        Monday    Espresso          25
Tuesday      Tuesday       Latte          20
Monday        Monday       Latte          15

# DATA FILTERING

In [157]:
bios.head()
bios.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 145500 entries, 0 to 145499
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   athlete_id    145500 non-null  int64
 1   name          145500 non-null  object
 2   born_date     143693 non-null  object
 3   born_city     110908 non-null  object
 4   born_region   110908 non-null  object
 5   born_country  110908 non-null  object
 6   NOC           145499 non-null  object
 7   height_cm     106651 non-null  float64
 8   weight_kg     102070 non-null  float64
 9   died_date     33940 non-null   object
dtypes: float64(2), int64(1), object(7)
memory usage: 11.1+ MB

In [158]:
bios.loc[bios['height_cm']  > 215]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
5089,5108,Viktor Pankrashkin,1957-06-19,Moskva (Moscow),Moskva,RUS,Soviet Union,220.0,112.0,1993-07-24
5583,5606,Paulinho Villas Boas,1963-01-26,São Paulo,São Paulo,BRA,Brazil,217.0,106.0,NaN
5673,5696,Gunther Behnke,1963-01-19,Leverkusen,Nordrhein-Westfalen,GER,Germany,221.0,114.0,NaN
5716,5739,Uwe Blab,1962-03-26,München (Munich),Bayern,GER,Germany West Germany,218.0,110.0,NaN
5781,5804,Tommy Burleson,1952-02-24,Crossnore,North Carolina,USA,United States,223.0,102.0,NaN
5796,5819,Andy Campbell,1956-07-21,Melbourne,Victoria,AUS,Australia,218.0,93.0,NaN
6223,6250,Lars Hansen,1954-09-27,København (Copenhagen),Hovedstaden,DEN,Canada,216.0,105.0,NaN
6270,6298,Hu Zhangbao,1963-04-05,NaN,NaN,NaN,People's Republic of China,216.0,135.0,NaN
6409,6440,Sergey Kovalenko,1947-08-11,NaN,NaN,NaN,Soviet Union,216.0,111.0,2004-11-18
6420,6451,Jānis Krūmiņš,1930-01-30,Cēsis,Cēsu novads,LAT,Soviet Union,218.0,141.0,1994-11-20
6504,6537,Luc Longley,1969-01-19,Melbourne,Victoria,AUS,Australia,220.0,135.0,NaN
6722,6755,Shaquille O'Neal,1972-03-06,Newark,New Jersey,USA,United States,216.0,137.0,NaN
6937,6972,David Robinson,1965-08-06,Key West,Florida,USA,United States,216.0,107.0,NaN
6978,7013,Arvydas Sabonis,1964-12-19,Kaunas,Kaunas,LTU,Lithuania Soviet Union,223.0,122.0,NaN
7074,7111,Paulo da Silva,1963-07-21,São Paulo,São Paulo,BRA,Brazil,217.0,106.0,NaN
7188,7226,Vladimir Tkachenko,1957-09-20,Golovinka,Krasnodar Kray,RUS,Soviet Union,220.0,110.0,NaN
7281,7320,Stojko Vranković,1964-01-22,Drniš,Šibensko-kninska županija,CRO,Croatia Yugoslavia,217.0,115.0,NaN
7376,7416,Eurelijus Žukauskas,1973-08-22,Klaipėda,Klaipėda,LTU,Lithuania,218.0,115.0,NaN
52608,52983,Aleksey Kazakov,1976-03-18,Naberezhnye Chelny,Respublika Tatarstan,RUS,Russian Federation,217.0,102.0,NaN
82100,82753,Frédéric Weis,1977-06-22,Thionville,Moselle,FRA,France,218.0,110.0,NaN
89070,89782,Yao Ming,1980-09-12,Xuhui District,Shanghai,CHN,People's Republic of China,226.0,141.0,NaN
89075,89787,Roberto Dueñas,1975-11-01,Madrid,Madrid,ESP,Spain,221.0,137.0,NaN
107408,108533,Peter John Ramos,1985-05-23,Fajardo,Puerto Rico,PUR,Puerto Rico,219.0,113.0,NaN
112312,113568,Stanko Barać,1986-08-13,Mostar,Hercegovačko-neretvanski kanton,BIH,Croatia,217.0,110.0,NaN
112332,113588,Andreas Glyniadakis,1981-08-26,Chania,Kriti,GRE,Greece,216.0,115.0,NaN
112337,113593,Hamed Haddadi,1985-05-19,Ahvaz,Khuzestan,IRI,Islamic Republic of Iran,218.0,110.0,NaN
118663,120400,Timofey Mozgov,1986-07-16,NaN,NaN,NaN,Russian Federation,216.0,113.0,NaN
118676,120415,Dmitry Musersky,1988-10-29,Makiïvka,Donetsk,UKR,Russian Federation,219.0,104.0,NaN
120266,122147,Zhang Zhaoxu,1987-11-18,Binzhou,Shandong,CHN,People's Republic of China,221.0,110.0,NaN
121694,123709,Salah Mejri,1986-06-15,Jendouba,Jendouba,TUN,Tunisia,216.0,110.0,NaN
123850,126093,Tyson Chandler,1982-10-02,Hanford,California,USA,United States,216.0,107.0,NaN
130460,133147,Li Muhao,1992-06-02,Guiyang,Guizhou,CHN,People's Republic of China,218.0,115.0,NaN
130461,133148,Zhou Qi,1996-01-16,Xinxiang,Henan,CHN,People's Republic of China,217.0,95.0,NaN
138671,142084,Ondřej Balvín,1992-09-20,Ústí nad Labem,Ústecký kraj,CZE,Czechia,216.0,107.0,NaN
139365,142836,Moustapha Fall,1992-02-23,Paris,Paris,FRA,France,218.0,NaN,NaN

In [159]:
(bios['height_cm'] > 215).sum()

np.int64(35)

In [160]:
bios.loc[bios['height_cm']  > 215, ['name','height_cm']].sort_values('height_cm', ascending=False)

                         name  height_cm
89070                Yao Ming      226.0
5781           Tommy Burleson      223.0
6978          Arvydas Sabonis      223.0
120266           Zhang Zhaoxu      221.0
89075          Roberto Dueñas      221.0
5673           Gunther Behnke      221.0
5089       Viktor Pankrashkin      220.0
6504              Luc Longley      220.0
7188       Vladimir Tkachenko      220.0
118676        Dmitry Musersky      219.0
107408       Peter John Ramos      219.0
130460               Li Muhao      218.0
82100           Frédéric Weis      218.0
139365         Moustapha Fall      218.0
112337          Hamed Haddadi      218.0
6420            Jānis Krūmiņš      218.0
7376      Eurelijus Žukauskas      218.0
5796            Andy Campbell      218.0
5716                 Uwe Blab      218.0
5583     Paulinho Villas Boas      217.0
130461                Zhou Qi      217.0
112312           Stanko Barać      217.0
7281         Stojko Vranković      217.0
52608         Aleksey Kazakov      217.0
7074           Paulo da Silva      217.0
6223              Lars Hansen      216.0
6270              Hu Zhangbao      216.0
6937           David Robinson      216.0
6722         Shaquille O'Neal      216.0
6409         Sergey Kovalenko      216.0
112332    Andreas Glyniadakis      216.0
118663         Timofey Mozgov      216.0
121694            Salah Mejri      216.0
123850         Tyson Chandler      216.0
138671          Ondřej Balvín      216.0

In [161]:
bios[bios['height_cm']  > 215][['name','height_cm']]

                         name  height_cm
5089       Viktor Pankrashkin      220.0
5583     Paulinho Villas Boas      217.0
5673           Gunther Behnke      221.0
5716                 Uwe Blab      218.0
5781           Tommy Burleson      223.0
5796            Andy Campbell      218.0
6223              Lars Hansen      216.0
6270              Hu Zhangbao      216.0
6409         Sergey Kovalenko      216.0
6420            Jānis Krūmiņš      218.0
6504              Luc Longley      220.0
6722         Shaquille O'Neal      216.0
6937           David Robinson      216.0
6978          Arvydas Sabonis      223.0
7074           Paulo da Silva      217.0
7188       Vladimir Tkachenko      220.0
7281         Stojko Vranković      217.0
7376      Eurelijus Žukauskas      218.0
52608         Aleksey Kazakov      217.0
82100           Frédéric Weis      218.0
89070                Yao Ming      226.0
89075          Roberto Dueñas      221.0
107408       Peter John Ramos      219.0
112312           Stanko Barać      217.0
112332    Andreas Glyniadakis      216.0
112337          Hamed Haddadi      218.0
118663         Timofey Mozgov      216.0
118676        Dmitry Musersky      219.0
120266           Zhang Zhaoxu      221.0
121694            Salah Mejri      216.0
123850         Tyson Chandler      216.0
130460               Li Muhao      218.0
130461                Zhou Qi      217.0
138671          Ondřej Balvín      216.0
139365         Moustapha Fall      218.0

In [162]:
bios[ (bios['height_cm']  > 215) & (bios['born_country'] == 'USA')][['name','height_cm']]

                    name  height_cm
5781      Tommy Burleson      223.0
6722    Shaquille O'Neal      216.0
6937      David Robinson      216.0
123850    Tyson Chandler      216.0

In [163]:
bios[bios['name'].str.contains('Akkuş|Hasan')]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
1686,1693,Hasan Al,1972-06-18,Sivas,Sivas,TUR,Denmark,173.0,67.0,NaN
8297,8342,Khurshed Hasanov,1973-08-19,NaN,NaN,NaN,Tajikistan,192.0,54.0,NaN
14583,14681,Saber Mohamed Hasan,1967-07-09,NaN,NaN,NaN,Bahrain,170.0,68.0,NaN
19823,19962,Abdul Rashid Al-Hasan,1959-04-14,Gojra,Punjab,PAK,Pakistan,170.0,63.0,NaN
22688,22858,Ali Hasan,1965-05-23,NaN,NaN,NaN,Kuwait,170.0,70.0,NaN
22689,22859,Kazem Hasan,1961-02-09,NaN,NaN,NaN,Kuwait,178.0,70.0,NaN
48643,48997,Ali Al-Hasan,1973-01-04,NaN,NaN,NaN,Kuwait,NaN,NaN,NaN
48648,49002,Hasan Al-Shammari,1967-02-21,NaN,NaN,NaN,Kuwait,177.0,71.0,NaN
56462,56865,Hasan Has,1960-01-15,NaN,NaN,NaN,Türkiye,165.0,75.0,NaN
57035,57441,Hasan Isaev,1952-11-09,Bisertsi,Razgrad,BUL,Bulgaria,155.0,48.0,NaN
59871,60298,Hasan Bozbey,1928-01-01,NaN,NaN,NaN,Türkiye,NaN,NaN,NaN
59899,60327,Hasan Gemici,1927-06-15,Giresun,Giresun,TUR,Türkiye,NaN,NaN,2001-06-25
59902,60331,Hasan Güngör,1934-07-05,Acıpayam,Denizli,TUR,Türkiye,178.0,87.0,2011-10-13
59942,60373,Hasan Sevinç,1933-01-01,Zile,Tokat,TUR,Türkiye,165.0,57.0,2012-11-15
64563,65050,Mohamed Mehdi Hasan,1971-09-14,NaN,NaN,NaN,Bangladesh,167.0,60.0,NaN
82538,83194,Hasan Orbay,1979-08-14,Ankara,Ankara,TUR,Türkiye,182.0,75.0,NaN
103096,104065,Hasan Kaan Özgönenç,1976-07-27,NaN,NaN,NaN,Türkiye,177.0,75.0,NaN
113673,114972,Hasan Mahboob,1981-12-31,Kapsabet,Nandi,KEN,Bahrain,178.0,69.0,NaN
115979,117354,Hasli Amir Hasan,1977-02-22,Ipoh,Perak,MAS,Malaysia,166.0,85.0,NaN
116040,117419,Burak Hasan,1985-07-04,Melbourne,Victoria,AUS,Australia,177.0,68.0,NaN
116157,117542,Ibrahim Al-Hasan,1986-08-22,NaN,NaN,NaN,Kuwait,179.0,73.0,NaN
118471,120189,Omar Hasanin,1978-11-09,Dimashq (Damascus),Dimashq,SYR,Syrian Arab Republic,178.0,75.0,NaN
133471,136410,Hasanboy Dusmatov,1993-06-24,NaN,NaN,NaN,Uzbekistan,156.0,49.0,NaN
137920,141302,Hasan Mirza,1998-06-18,NaN,NaN,NaN,Bahrain,NaN,NaN,NaN
137921,141303,Hasan Al-Samahiji,1991-02-22,NaN,NaN,NaN,Bahrain,NaN,NaN,NaN
143323,146966,Mihraç Akkuş,2000-06-01,Iğdır,Iğdır,TUR,Türkiye,NaN,NaN,NaN

In [164]:
bios[bios['name'].str.contains('Akkuş|Hasan',regex=False) ]

Empty DataFrame
Columns: [athlete_id, name, born_date, born_city, born_region, born_country, NOC, height_cm, weight_kg, died_date]
Index: []

In [165]:
coffee.sort_values('Units Sold', ascending=False)

                 Day Coffee Type  Units Sold
Day
Wednesday  Wednesday    Espresso        1000
Wednesday  Wednesday       Latte        1000
Saturday    Saturday    Espresso          45
Sunday        Sunday    Espresso          45
Friday        Friday    Espresso          45
Thursday    Thursday    Espresso          40
Saturday    Saturday       Latte          35
Friday        Friday       Latte          35
Sunday        Sunday       Latte          35
Tuesday      Tuesday    Espresso          30
Thursday    Thursday       Latte          30
Monday        Monday    Espresso          25
Tuesday      Tuesday       Latte          20
Monday        Monday       Latte          15

In [166]:
bios.query('born_country == "USA" and height_cm > 215')[['name','height_cm']]

                    name  height_cm
5781      Tommy Burleson      223.0
6722    Shaquille O'Neal      216.0
6937      David Robinson      216.0
123850    Tyson Chandler      216.0

# COLUMN MANIPULATION

In [167]:
coffee_new = coffee
coffee_deep_copy = coffee.copy()
coffee['price'] = 4.99

In [168]:
coffee.head()

                 Day Coffee Type  Units Sold  price
Day
Monday        Monday    Espresso          25   4.99
Monday        Monday       Latte          15   4.99
Tuesday      Tuesday    Espresso          30   4.99
Tuesday      Tuesday       Latte          20   4.99
Wednesday  Wednesday    Espresso        1000   4.99

In [169]:
import numpy as np
coffee['new_price'] = np.where(coffee['Coffee Type'] == 'Espresso', 3.99, 5.99)

In [170]:
coffee.head()

                 Day Coffee Type  Units Sold  price  new_price
Day
Monday        Monday    Espresso          25   4.99       3.99
Monday        Monday       Latte          15   4.99       5.99
Tuesday      Tuesday    Espresso          30   4.99       3.99
Tuesday      Tuesday       Latte          20   4.99       5.99
Wednesday  Wednesday    Espresso        1000   4.99       3.99

In [171]:
coffee.drop(columns=['new_price'])

                 Day Coffee Type  Units Sold  price
Day
Monday        Monday    Espresso          25   4.99
Monday        Monday       Latte          15   4.99
Tuesday      Tuesday    Espresso          30   4.99
Tuesday      Tuesday       Latte          20   4.99
Wednesday  Wednesday    Espresso        1000   4.99
Wednesday  Wednesday       Latte        1000   4.99
Thursday    Thursday    Espresso          40   4.99
Thursday    Thursday       Latte          30   4.99
Friday        Friday    Espresso          45   4.99
Friday        Friday       Latte          35   4.99
Saturday    Saturday    Espresso          45   4.99
Saturday    Saturday       Latte          35   4.99
Sunday        Sunday    Espresso          45   4.99
Sunday        Sunday       Latte          35   4.99

In [172]:
coffee.drop(columns=['new_price'], inplace=True)

In [173]:
coffee.head()

                 Day Coffee Type  Units Sold  price
Day
Monday        Monday    Espresso          25   4.99
Monday        Monday       Latte          15   4.99
Tuesday      Tuesday    Espresso          30   4.99
Tuesday      Tuesday       Latte          20   4.99
Wednesday  Wednesday    Espresso        1000   4.99

In [174]:
coffee_new

                 Day Coffee Type  Units Sold  price
Day
Monday        Monday    Espresso          25   4.99
Monday        Monday       Latte          15   4.99
Tuesday      Tuesday    Espresso          30   4.99
Tuesday      Tuesday       Latte          20   4.99
Wednesday  Wednesday    Espresso        1000   4.99
Wednesday  Wednesday       Latte        1000   4.99
Thursday    Thursday    Espresso          40   4.99
Thursday    Thursday       Latte          30   4.99
Friday        Friday    Espresso          45   4.99
Friday        Friday       Latte          35   4.99
Saturday    Saturday    Espresso          45   4.99
Saturday    Saturday       Latte          35   4.99
Sunday        Sunday    Espresso          45   4.99
Sunday        Sunday       Latte          35   4.99

In [175]:
coffee_deep_copy

                 Day Coffee Type  Units Sold
Day
Monday        Monday    Espresso          25
Monday        Monday       Latte          15
Tuesday      Tuesday    Espresso          30
Tuesday      Tuesday       Latte          20
Wednesday  Wednesday    Espresso        1000
Wednesday  Wednesday       Latte        1000
Thursday    Thursday    Espresso          40
Thursday    Thursday       Latte          30
Friday        Friday    Espresso          45
Friday        Friday       Latte          35
Saturday    Saturday    Espresso          45
Saturday    Saturday       Latte          35
Sunday        Sunday    Espresso          45
Sunday        Sunday       Latte          35

In [176]:
coffee['revenue'] = coffee['Units Sold'] * coffee['price']

In [177]:
coffee

                 Day Coffee Type  Units Sold  price  revenue
Day
Monday        Monday    Espresso          25   4.99   124.75
Monday        Monday       Latte          15   4.99    74.85
Tuesday      Tuesday    Espresso          30   4.99   149.70
Tuesday      Tuesday       Latte          20   4.99    99.80
Wednesday  Wednesday    Espresso        1000   4.99  4990.00
Wednesday  Wednesday       Latte        1000   4.99  4990.00
Thursday    Thursday    Espresso          40   4.99   199.60
Thursday    Thursday       Latte          30   4.99   149.70
Friday        Friday    Espresso          45   4.99   224.55
Friday        Friday       Latte          35   4.99   174.65
Saturday    Saturday    Espresso          45   4.99   224.55
Saturday    Saturday       Latte          35   4.99   174.65
Sunday        Sunday    Espresso          45   4.99   224.55
Sunday        Sunday       Latte          35   4.99   174.65

In [178]:
coffee.rename(columns={'new_price': 'price'}, inplace=True)

In [179]:
coffee

                 Day Coffee Type  Units Sold  price  revenue
Day
Monday        Monday    Espresso          25   4.99   124.75
Monday        Monday       Latte          15   4.99    74.85
Tuesday      Tuesday    Espresso          30   4.99   149.70
Tuesday      Tuesday       Latte          20   4.99    99.80
Wednesday  Wednesday    Espresso        1000   4.99  4990.00
Wednesday  Wednesday       Latte        1000   4.99  4990.00
Thursday    Thursday    Espresso          40   4.99   199.60
Thursday    Thursday       Latte          30   4.99   149.70
Friday        Friday    Espresso          45   4.99   224.55
Friday        Friday       Latte          35   4.99   174.65
Saturday    Saturday    Espresso          45   4.99   224.55
Saturday    Saturday       Latte          35   4.99   174.65
Sunday        Sunday    Espresso          45   4.99   224.55
Sunday        Sunday       Latte          35   4.99   174.65

In [180]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

In [181]:
bios_new = bios.copy()

In [182]:
bios_new['first_name'] = bios_new['name'].str.split(' ').str[0]
bios_new['last_name'] = bios_new['name'].str.split(' ').str[1]

In [184]:
bios_new.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,first_name,last_name
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Jean-François,Blanchy
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Arnaud,Boetsch
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Jean,Borotra
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Jacques,Brugnon
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Albert,Canet

In [185]:
bios_new.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 145500 entries, 0 to 145499
Data columns (total 12 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   athlete_id    145500 non-null  int64
 1   name          145500 non-null  object
 2   born_date     143693 non-null  object
 3   born_city     110908 non-null  object
 4   born_region   110908 non-null  object
 5   born_country  110908 non-null  object
 6   NOC           145499 non-null  object
 7   height_cm     106651 non-null  float64
 8   weight_kg     102070 non-null  float64
 9   died_date     33940 non-null   object
 10  first_name    145500 non-null  object
 11  last_name     145500 non-null  object
dtypes: float64(2), int64(1), object(9)
memory usage: 13.3+ MB

In [186]:
bios_new['born_datetime'] = pd.to_datetime(bios_new['born_date'])

In [187]:
bios_new

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,first_name,last_name,born_datetime
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Jean-François,Blanchy,1886-12-12
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Arnaud,Boetsch,1969-04-01
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Jean,Borotra,1898-08-13
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Jacques,Brugnon,1895-05-11
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Albert,Canet,1878-04-17
...,...,...,...,...,...,...,...,...,...,...,...,...,...
145495,149222,Polina Luchnikova,2002-01-30,Serov,Sverdlovsk,RUS,ROC,167.0,61.0,NaN,Polina,Luchnikova,2002-01-30
145496,149223,Valeriya Merkusheva,1999-09-20,Moskva (Moscow),Moskva,RUS,ROC,168.0,65.0,NaN,Valeriya,Merkusheva,1999-09-20
145497,149224,Yuliya Smirnova,1998-05-08,Kotlas,Arkhangelsk,RUS,ROC,163.0,55.0,NaN,Yuliya,Smirnova,1998-05-08
145498,149225,André Foussard,1899-05-19,Niort,Deux-Sèvres,FRA,France,166.0,NaN,1986-03-18,André,Foussard,1899-05-19
145499,149814,Bill Phillips,1913-07-15,Dulwich Hill,New South Wales,AUS,Australia,NaN,NaN,2003-10-20,Bill,Phillips,1913-07-15

In [188]:
bios_new.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 145500 entries, 0 to 145499
Data columns (total 13 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   athlete_id     145500 non-null  int64
 1   name           145500 non-null  object
 2   born_date      143693 non-null  object
 3   born_city      110908 non-null  object
 4   born_region    110908 non-null  object
 5   born_country   110908 non-null  object
 6   NOC            145499 non-null  object
 7   height_cm      106651 non-null  float64
 8   weight_kg      102070 non-null  float64
 9   died_date      33940 non-null   object
 10  first_name     145500 non-null  object
 11  last_name      145500 non-null  object
 12  born_datetime  143693 non-null  datetime64[ns]
dtypes: datetime64[ns](1), float64(2), int64(1), object(9)
memory usage: 14.4+ MB

In [189]:
bios_new['born_year'] = bios_new['born_datetime'].dt.year

In [191]:
bios_new

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,first_name,last_name,born_datetime,born_year
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Jean-François,Blanchy,1886-12-12,1886.0
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Arnaud,Boetsch,1969-04-01,1969.0
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Jean,Borotra,1898-08-13,1898.0
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Jacques,Brugnon,1895-05-11,1895.0
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Albert,Canet,1878-04-17,1878.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
145495,149222,Polina Luchnikova,2002-01-30,Serov,Sverdlovsk,RUS,ROC,167.0,61.0,NaN,Polina,Luchnikova,2002-01-30,2002.0
145496,149223,Valeriya Merkusheva,1999-09-20,Moskva (Moscow),Moskva,RUS,ROC,168.0,65.0,NaN,Valeriya,Merkusheva,1999-09-20,1999.0
145497,149224,Yuliya Smirnova,1998-05-08,Kotlas,Arkhangelsk,RUS,ROC,163.0,55.0,NaN,Yuliya,Smirnova,1998-05-08,1998.0
145498,149225,André Foussard,1899-05-19,Niort,Deux-Sèvres,FRA,France,166.0,NaN,1986-03-18,André,Foussard,1899-05-19,1899.0
145499,149814,Bill Phillips,1913-07-15,Dulwich Hill,New South Wales,AUS,Australia,NaN,NaN,2003-10-20,Bill,Phillips,1913-07-15,1913.0